export const directions = [
    {
        id: 1,
        name: "Абхазия",
        trips: [],
    },
    {
        id: 2,
        name: "Адыгея",
        trips: [1, 2, 3, 4],
    },
    {
        id: 3,
        name: "Архыз",
        trips: [14],
    },
    {
        id: 4,
        name: "Гуамка",
        trips: [6, 17],
    },
    {
        id: 5,
        name: "Дагестан",
        trips: [7],
    },
    {
        id: 6,
        name: "Дигория",
        trips: [],
    },
    {
        id: 7,
        name: "Домбай",
        trips: [8, 15],
    },

    {
        id: 8,
        name: "Кисловодск",
        trips: [5, 8, 19],
    },
    {
        id: 9,
        name: "Нальчик",
        trips: [9],
    },
    {
        id: 10,
        name: "Осетия",
        trips: [10],
    },
    {
        id: 11,
        name: "Парк Галицкого",
        trips: [11, 18],
    },
    {
        id: 12,
        name: "Эльбрус",
        trips: [12, 13, 16],
    },

];

export const trips = [
    {
        name: "Адыгея: Гузерипль однодневный",
        id: 1,
        date: null,
        duration: 1,
        seats: 0,
        places: [
            "Заповедник Гузерипль",
            "Яворова поляна",
            "Красивейшие смотровые площадки",
            "Термальные источники",
        ],
        optional: [
            "Питание",
            "Термальные источники",
            "Прокат санок, снегоходов, и прочих развлечений",
        ],
        slides: 70,
        price: null
    },
    {
        name: "Адыгея: Лагонаки однодневный",
        id: 2,
        date: null,
        duration: 1,
        seats: 4,
        places: [
            "Плато Лагонаки",
            "Водопады Руфабго",
            "Красивейшие смотровые площадки",
            "Термальные источники",
        ],
        optional: [
            "Питание",
            "Термальные источники",
        ],
        slides: 13,
        price: null
    },
    {
        name: "Адыгея + Сахрайские водопады",
        id: 3,
        date: null,
        duration: 2,
        seats: 1,
        places: [
            "Сахрайские водопады",
            "Михайло-Афонский мужской монастырь",
            "Смотровая площадка на г.Физиабго",
            "Источник Святого Пантелеймона Целителя",
            "Кавказский заповедник Гузерипль",
            "Удивительный музей Беловодье"
        ],
        optional: [
            "Вход в музей",
            "Вход в заповедник",
        ],
        slides: 40,
        price: null
    },
    {
        name: "Адыгея: Хаджохская теснина",
        id: 4,
        date: null,
        duration: 2,
        seats: 4,
        places: [
            "Поход к скале Молоток",
            "Хаджохская теснина",
            "Михайло-Афонский мужской монастырь",
            "Смотровая площадка на г.Физиабго",
            "Источник Святого Пантелеймона Целителя",
            "Кавказский заповедник Гузерипль",
            "Удивительный музей Беловодье"
        ],
        optional: [
            "Питание (обеды)",
        ],
        slides: 42,
        price: null
    },
    {
        name: "Бермамыт + Джилы-Су",
        id: 5,
        date: null,
        duration: 2,
        seats: 11,
        places: [
            "Плато Бермамыт",
            "Урочище Джилы-су",
            "Плато Шаджатмаз",
            "Долина нарзанов",
            "Смотровые на Эльбрус",
            "Ущелье Харбас",
            "Водопад Каракая-су",
            "Водопады: Султан-су, Кызылкол-су",
            "Поляна Эммануэля",
            "Серебряный источник",
        ],
        optional: [
            "Питание",
            "Эко сборы",
        ],
        slides: 58,
        price: null
    },
    {
        name: "Гуамское ущелье Мезмай",
        id: 6,
        date: null,
        duration: 2,
        seats: 10,
        places: [
            "Орлиная полка",
            "Сказочное Гуамское ущелье",
            "Экскурсионный паровозик",
            "Водопад Университетский",
            "Водопад Чинарский",
            "Термальные источники",
        ],
        optional: [
            "Питание",
            "Термальные источники",
        ],
        slides: 64,
        price: null
    },
    {
        name: "Дагестан",
        id: 7,
        date: null,
        duration: 2,
        seats: null,
        places: [
            "Крепость Нарын-кала",
            "Прогулка по старому городу",
            "Вечерний Дербент",
            "с.Гамсутль",
            "Ирганайское водохранилище",
            "Чикрейское водохранилище",
            "Сулакский каньон",
            "Прогулка на катерах",
            "Пещера Нохъо",
        ],
        optional: [
            "Питание (обеды, ужины)",
            "Катание на катерах",
            "Подъем на Гамсутль",
            "Вход в крепость",
            "Вход в пещеру",
        ],
        slides: 45,
        price: null
    },
    {
        name: "Домбай + Джилы-Су",
        id: 8,
        date: null,
        duration: 2,
        seats: null,
        places: [
            "Канатная дорога",
            "Озеро Туманлы-Кёль",
            "Шаонинский храм",
            "Джиппинг на урочище Джилы-су",
            "Плато Шаджатмаз",
            "Долина нарзанов",
            "Смотровые на Эльбрус",
            "Ущелье Харбас",
            "Водопад Каракая-су",
            "Водопады: Султан-су, Кызылкол-су",
            "Поляна Эммануэля",
            "Серебряный источник",
        ],
        optional: [
            "Питание",
            "Подъем на канатке",
        ],
        slides: 65,
        price: null
    },
    {
        name: "Нальчик + Верхняя Балкария",
        id: 9,
        date: null,
        duration: 2,
        seats: null,
        places: [
            "Обзорная экскурсия по городу",
            "Чегемские водопады",
            "Множество красивейших локаций",
            "Группа горных Голубых озер",
            "Старинные Балкарские башни",
            "Ущелье Черекская теснина",
            "Замок на воде Шато-Эркен",
        ],
        optional: [
            "Питание",
            "Канатная дорога",
        ],
        slides: 65,
        price: null
    },
    {
        name: "Осетия: Золотое кольцо",
        id: 10,
        date: new Date('2025-11-15'),
        duration: 2,
        seats: 2,
        places: [
            "Дигорское ущелье",
            "Водопад Три сестры",
            "Водопад Байради",
            "Цейское ущелье",
            "Дзивгисская наскальная крепость",
            "Аланский  Свято-Успенский мужской монастырь",
            "Даргавский Некрополь «Город мертвых»",
            "Кармадонское ущелье",
        ],
        optional: [
            "Питание",
            "Канатная дорога",
            "Входные билеты",
        ],
        slides: 15,
        price: 16000
    },
    {
        name: "Парк Галицкого",
        id: 11,
        date: null,
        duration: 1,
        seats: null,
        places: [
            "Природный оазис в сердце мегаполиса",
            "Красота вечернего парка",
        ],
        optional: [
            "Питание",
        ],
        slides: 21,
        price: null
    },
    {
        name: "Эльбрус: водопад Азау-су",
        id: 12,
        date: null,
        duration: 2,
        seats: null,
        places: [
            "Прогулка к водопаду Азау-су",
            "Неповторимая панорама Кавказских гор",
            "Поляна Чегет",
            "Озеро Гижгит",
        ],
        optional: [
            "Термальные источники",
            "Канатная дорога к озеру",
            "Питание",
            "Прочие развлечения",
        ],
        slides: 57,
        price: null
    },
    {
        name: "Эльбрус: трекинг",
        id: 13,
        date: null,
        duration: 2,
        seats: null,
        places: [
            "Трекинг к водопаду Терскол",
            "Трекинг к озеру Донгуз Орун-Кёль",
            "Термальные источники",
        ],
        optional: [
            "Термальные источники",
            "Канатная дорога к озеру",
            "Питание",
            "Прочие развлечения",
        ],
        slides: 42,
        price: null
    },
    {
        name: "Архыз: Софийские водопады",
        id: 14,
        date: null,
        duration: 2,
        seats: null,
        places: [
            "Джиппинг на Софийские водопады",
            "Аланское городище",
            "Лик Христа",
            "Шаонинский храм",
            "Термальные источники",
        ],
        optional: [
            "Термальные источники",
            "Питание",
        ],
        slides: 16,
        price: null
    },
    {
        name: "Домбай однодневный",
        id: 15,
        date: null,
        duration: 1,
        seats: null,
        places: [
            "Канатная дорога",
            "Озеро Туманлы-Кёль",
            "Шаонинский храм",
        ],
        optional: [
            "Подъем на канатке",
            "Питание",
        ],
        slides: 15,
        price: null
    },
    {
        name: "Эльбрус: улыбка Шхельды",
        id: 16,
        date: new Date('2025-10-11'),
        duration: 2,
        seats: 4,
        places: [
            "Трекинг на улыбку Шхельды ",
            "Озеро Гижгит",
        ],
        optional: [
            "Термальные источники",
            "Питание",
            "Прочие развлечения",
        ],
        slides: 46,
        price: 14000
    },
    {
        name: "Гуамское ущелье однодневный",
        id: 17,
        date: null,
        duration: 1,
        seats: 10,
        places: [
            "Сказочное Гуамское ущелье",
            "Экскурсионный паровозик",
            "Термальные источники",
        ],
        optional: [
            "Питание",
            "Термальные источники",
        ],
        slides: 9,
        price: null
    },
    {
        name: "Горячий ключ + Парк Галицкого",
        id: 18,
        date: null,
        duration: 1,
        seats: null,
        places: [
            "Горячий ключ",
            "Парк Галицкого",
        ],
        optional: [
            "Питание",
        ],
        slides: 13,
        price: null
    },
    {
        name: "Бермамыт + Кисловодск",
        id: 19,
        date: null,
        duration: 2,
        seats: 11,
        places: [
            "Плато Бермамыт",
            "Кисловодский парк",
            "Медовые водопады",
            "Гора Кольцо",
            "Термальные источники",
        ],
        optional: [
            "Питание",
            "Термальные источники",
        ],
        slides: 17,
        price: null
    },
];

for (let direction of directions) {
    if (direction.trips.length == 0) continue;
    for (let tripId of direction.trips) {
        let t = trips.find((trip) => trip.id == tripId);
        t.direction = direction.name;
    }
}
